In [1]:
import pandas as pd
import numpy as np

student = {'Name': ['Ashwani', 'Sushant', 'Debjeet', 'jay', 'shaan', 'solomon', 'suvrajit'],
           'Roll_no': [5, 13, 2, 22, 8, 16, 6],
           'Age': [20, 22, 19, 20, 19, 20, 19],
           'M1': [84, 83, 95, 85, 88, 95, 87],
           'M2': [96, 95, 98, 97, 85, 86, 81],
           'M3': [56, 86, 83, 89, 84, 88, 83],
           'M4': [86, 87, 98, 95, 62, 85, 95]}

df = pd.DataFrame(student) 
print(df)

       Name  Roll_no  Age  M1  M2  M3  M4
0   Ashwani        5   20  84  96  56  86
1   Sushant       13   22  83  95  86  87
2   Debjeet        2   19  95  98  83  98
3       jay       22   20  85  97  89  95
4     shaan        8   19  88  85  84  62
5   solomon       16   20  95  86  88  85
6  suvrajit        6   19  87  81  83  95

In [3]:
df.dropna()

       Name  Roll_no  Age  M1  M2  M3  M4
0   Ashwani        5   20  84  96  56  86
1   Sushant       13   22  83  95  86  87
2   Debjeet        2   19  95  98  83  98
3       jay       22   20  85  97  89  95
4     shaan        8   19  88  85  84  62
5   solomon       16   20  95  86  88  85
6  suvrajit        6   19  87  81  83  95

In [5]:
import pandas as pd
import numpy as np

student = {'Name': ['Ashwani', 'Sushant', 'Debjeet', 'jay', 'shaan', 'solomon', 'suvrajit'],
           'Roll_no': [5, 13, 2, 22, 8, 16, 6],
           'Age': [20, 22, 19, 20, 19, 20, 19],
           'M1': [84, 83, 95, 85, 88, 95, 87],
           'M2': [96, 95, 98, 97, 85, 86, 81],
           'M3': [56, 86, 83, 89, 84, 88, 83],
           'M4': [86, 87, 98, 95, 62, 85, 95]}

df = pd.DataFrame(student) 
print(df)

       Name  Roll_no  Age  M1  M2  M3  M4
0   Ashwani        5   20  84  96  56  86
1   Sushant       13   22  83  95  86  87
2   Debjeet        2   19  95  98  83  98
3       jay       22   20  85  97  89  95
4     shaan        8   19  88  85  84  62
5   solomon       16   20  95  86  88  85
6  suvrajit        6   19  87  81  83  95

In [7]:
df.fillna(999)

       Name  Roll_no  Age  M1  M2  M3  M4
0   Ashwani        5   20  84  96  56  86
1   Sushant       13   22  83  95  86  87
2   Debjeet        2   19  95  98  83  98
3       jay       22   20  85  97  89  95
4     shaan        8   19  88  85  84  62
5   solomon       16   20  95  86  88  85
6  suvrajit        6   19  87  81  83  95

In [9]:
df["M1"].fillna(67)

0    84
1    83
2    95
3    85
4    88
5    95
6    87
Name: M1, dtype: int64

In [15]:
x=df["M3"].mean()
df["M3"].fillna(x)

0    56
1    86
2    83
3    89
4    84
5    88
6    83
Name: M3, dtype: int64

In [17]:
import pandas as pd
import numpy as np

student = {'Name': ['Ashwani', 'Sushant', 'Debjeet', 'jay', 'shaan', 'solomon', 'suvrajit'],
           'Roll_no': [5, 13, 2, 22, 8, 16, 6],
           'Age': [20, 22, 19, 20, 19, 20, 19],
           'M1': [84, 83, 95, 85, 88, 95, 87],
           'M2': [96, 95, 98, 97, 85, 86, 81],
           'M3': [56, 86, 83, 89, 84, 88, 83],
           'M4': [86, 87, 98, 95, 62, 85, 95]}

df = pd.DataFrame(student) 
print(df)

       Name  Roll_no  Age  M1  M2  M3  M4
0   Ashwani        5   20  84  96  56  86
1   Sushant       13   22  83  95  86  87
2   Debjeet        2   19  95  98  83  98
3       jay       22   20  85  97  89  95
4     shaan        8   19  88  85  84  62
5   solomon       16   20  95  86  88  85
6  suvrajit        6   19  87  81  83  95

In [19]:
y=df["M1"].median()
df["M1"].fillna(y)

0    84
1    83
2    95
3    85
4    88
5    95
6    87
Name: M1, dtype: int64

In [23]:
df.loc[4,'M3']=456
df['M3']

0     56
1     86
2     83
3     89
4    456
5    456
6     83
Name: M3, dtype: int64

In [37]:
for x in df.index:
    if df.loc[x,'M3']<100:
        df.drop(x,inplace=True)
print(df['M3'])

Series([], Name: M3, dtype: int64)

In [ ]:
import pandas as pd
import numpy as np

student = {'Name': ['Ashwani', 'Sushant', 'Debjeet', 'jay', 'shaan', 'solomon', 'suvrajit'],
           'Roll_no': [5, 13, 2, 22, 8, 16, 6],
           'Age': [20, 22, 19, 20, 19, 20, 19],
           'M1': [84, 83, 95, 85, 88, 95, 87],
           'M2': [96, 95, 98, 97, 85, 86, 81],
           'M3': [56, 86, 83, 89, 84, 88, 83],
           'M4': [86, 87, 98, 95, 62, 85, 95]}

df = pd.DataFrame(student) 
print(df)

In [35]:
for x in df.index:
    if df.loc[x,'M3']>100:
        df.drop(x,inplace=True)
print(df['M3'])

Series([], Name: M3, dtype: int64)